Revit 2026 API

# DirectShapeTypeIsValidShape(IListGeometryObject) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidShape(
	IList<GeometryObject> shape
)
```
```vb
Public Function IsValidShape (
	shape As IList(Of GeometryObject)
) As Boolean
```
```cpp
public:
bool IsValidShape(
	IList<GeometryObject^>^ shape
)
```
```fsharp
member IsValidShape :
        shape : IList<GeometryObject> -> bool
```

#### Parameters

shape IListGeometryObject

#### Return Value

Boolean

#### Reference

DirectShapeType Class

IsValidShape Overload

Autodesk.Revit.DB Namespace